tags/politics.org
#+title: Tagged: Politics
#+setupfile: ../org-templates/post.org

- [[file:../posts/2009-08-28-triumph-of-the-will.org][Triumph of the Will]]
- [[file:../posts/2017-12-04-no-democrat-voted-for-what.org][No Democrat Voted for What?]]
- [[file:../posts/2008-05-19-international-aid-and-religious-freedom.org][International Aid and Religious Freedom]]
- [[file:../posts/2008-11-03-election-tomorrow.org][Election Tomorrow]]
- [[file:../posts/2016-11-09-interesting-times.org][Interesting Times]]
- [[file:../posts/2016-12-03-the-rise-of-fake-news.org][The Rise of Fake News]]
- [[file:../posts/2008-06-02-climate-change-and-objectivity.org][Climate Change and Objectivity]]
- [[file:../posts/2016-10-20-the-uselessness-of-political-factchecking.org][The Uselessness of Political Fact-Checking]]
- [[file:../posts/2016-10-21-the-clinton-foundation.org][Confirmation Bias and the Clinton Foundation]]
- [[file:../posts/2017-03-16-obamas-economic-record.org][Obama's Economic Record]]
- [[file:../posts/2008-11-07-reconciliation-and-hope.org][Reconciliation and Hope]]
- [[file:../posts/2018-06-19-family-separation-at-the-borders.org][Family Separation at the Borders]]
- [[file:../posts/2016-11-09-the-idol-of-the--poll.org][The Idol of the Poll]]
- [[file:../posts/2015-01-13-thoughts-on-burwell-vs-hobby-lobby.org][Thoughts on Burwell vs. Hobby Lobby]]
- [[file:../posts/2010-08-11-advice-for-christian-politicians.org][Advice for Christian Politicians]]
- [[file:../posts/2010-08-16-a-mosque-in-nyc.org][A Mosque in NYC]]
- [[file:../posts/2017-03-14-usury-in-oklahoma-.org][Usury in Oklahoma]]
- [[file:../posts/2017-05-04-thoughts-on-the-johnson-amendment.org][Thoughts on Trump and the Johnson Amendment]]

- [[file:../posts/2016-10-01-black-lives-matter-and-conditional-probabilities.org][Race, Police Shooting, and Probability]]
- [[file:../posts/2019-08-06-some-thoughts-on-mass-shootings.org][Some Thoughts on Mass Shootings]]
- [[file:../posts/2025-04-04-surviving-apocalypse.org][Surviving the Apocalypse]]
- [[file:../posts/2025-05-03-christian-right-religious-right.org][Christian Right or Religious Right?]]