docs/tags/politics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Apr 08, 2025 19:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tagged: Politics</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Tagged: Politics</h1>
<ul class="org-ul">
<li><a href="../posts/2009-08-28-triumph-of-the-will.html">Triumph of the Will</a></li>
<li><a href="../posts/2017-12-04-no-democrat-voted-for-what.html">No Democrat Voted for What?</a></li>
<li><a href="../posts/2008-05-19-international-aid-and-religious-freedom.html">International Aid and Religious Freedom</a></li>
<li><a href="../posts/2008-11-03-election-tomorrow.html">Election Tomorrow</a></li>
<li><a href="../posts/2016-11-09-interesting-times.html">Interesting Times</a></li>
<li><a href="../posts/2016-12-03-the-rise-of-fake-news.html">The Rise of Fake News</a></li>
<li><a href="../posts/2008-06-02-climate-change-and-objectivity.html">Climate Change and Objectivity</a></li>
<li><a href="../posts/2016-10-20-the-uselessness-of-political-factchecking.html">The Uselessness of Political Fact-Checking</a></li>
<li><a href="../posts/2016-10-21-the-clinton-foundation.html">Confirmation Bias and the Clinton Foundation</a></li>
<li><a href="../posts/2017-03-16-obamas-economic-record.html">Obama&rsquo;s Economic Record</a></li>
<li><a href="../posts/2008-11-07-reconciliation-and-hope.html">Reconciliation and Hope</a></li>
<li><a href="../posts/2018-06-19-family-separation-at-the-borders.html">Family Separation at the Borders</a></li>
<li><a href="../posts/2016-11-09-the-idol-of-the--poll.html">The Idol of the Poll</a></li>
<li><a href="../posts/2015-01-13-thoughts-on-burwell-vs-hobby-lobby.html">Thoughts on Burwell vs. Hobby Lobby</a></li>
<li><a href="../posts/2010-08-11-advice-for-christian-politicians.html">Advice for Christian Politicians</a></li>
<li><a href="../posts/2010-08-16-a-mosque-in-nyc.html">A Mosque in NYC</a></li>
<li><a href="../posts/2017-03-14-usury-in-oklahoma-.html">Usury in Oklahoma</a></li>
<li><a href="../posts/2017-05-04-thoughts-on-the-johnson-amendment.html">Thoughts on Trump and the Johnson Amendment</a></li>

<li><a href="../posts/2016-10-01-black-lives-matter-and-conditional-probabilities.html">Race, Police Shooting, and Probability</a></li>
<li><a href="../posts/2019-08-06-some-thoughts-on-mass-shootings.html">Some Thoughts on Mass Shootings</a></li>
<li><a href="../posts/2025-04-04-surviving-apocalypse.html">Surviving the Apocalypse</a></li>
</ul>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Apr 08, 2025 19:53.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
